package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
*/
import java.util.*;

public class Solution {
    public static void main(String[] args) {
        System.out.println("13 02 2019");
        //напишите тут ваш код
    }
}
